In [1]:
import numpy as np
import pandas as pd

In [34]:
df = pd.DataFrame({
    "A" : [1, 2, 3, 4, 5],
    "B" : [10, 20, 30, 40, 50],
    "C" : [100, 200, 300, 400, 500]
})
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

### DATA FRAME BASIC OPERATION:

In [3]:
df.shape

(5, 3)

In [9]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [11]:
df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [12]:
df["A"] * 1000

0    1000
1    2000
2    3000
3    4000
4    5000
Name: A, dtype: int64

In [16]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

### DATAFRAME APPLYING FUNCTIONS

In [35]:
df[["A", "B", "C"]] * 10

    A    B     C
0  10  100  1000
1  20  200  2000
2  30  300  3000
3  40  400  4000
4  50  500  5000

In [ ]:
# create custom function for square on dataFrame

def square(a):
    return a**2

df[["A", "B", "C"]].apply(square) # use custom function

    A     B       C
0   1   100   10000
1   4   400   40000
2   9   900   90000
3  16  1600  160000
4  25  2500  250000

In [36]:
# using lambda function

cube = lambda x : x**3
df[["A", "B", "C"]].apply(cube)

     A       B          C
0    1    1000    1000000
1    8    8000    8000000
2   27   27000   27000000
3   64   64000   64000000
4  125  125000  125000000

In [21]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [ ]:
df[["A", "B", "C"]] = df[["A", "B", "C"]].apply(cube) # it changes on main dataFrame
df

In [ ]:
# Add D columns, there will be ans for multiply by 10 in B columns

df["D"] = df["B"].apply(lambda i : i * 10)
df

   A   B    C    D
0  1  10  100  100
1  2  20  200  200
2  3  30  300  300
3  4  40  400  400
4  5  50  500  500